#Вы организуете спортивную лигу по круговой системе. Каждая команда встречается со всеми остальными командами.
#В вашей лиге победа дает команде, ничья дает обеим командам. После нескольких игр вы должны вычислить порядок команд в вашей лиге. 
#Для расстановки команд используются следующие критерии:2 points1 point

#Точки
#Разница забитых и пропущенных мячей (разница между забитыми и пропущенными мячами)
#Забитые голы
#Сначала вы сортируете команды по набранным очкам. Если две или более команд набрали одинаковое количество очков, в игру вступает второй критерий и так далее.
#Наконец, если все критерии одинаковы, команды делят между собой места.

